Revit 2027 API
WorksharingDisplaySettings.SetGraphicOverrides(ModelUpdatesStatus, WorksharingDisplayGraphicSettings) Method
 Sets the graphic overrides assigned to elements with a particular status in the central model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetGraphicOverrides(
	ModelUpdatesStatus status,
	WorksharingDisplayGraphicSettings overrides
)
Public Sub SetGraphicOverrides (
	status As ModelUpdatesStatus,
	overrides As WorksharingDisplayGraphicSettings
)
public:
void SetGraphicOverrides(
	ModelUpdatesStatus status,
	WorksharingDisplayGraphicSettings^ overrides
)
member SetGraphicOverrides :
        status : ModelUpdatesStatus *
        overrides : WorksharingDisplayGraphicSettings -> unit
Parameters
status ModelUpdatesStatus
 The status in the central model.
overrides WorksharingDisplayGraphicSettings
 The desired graphic overrides for this status.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
WorksharingDisplaySettings Class
SetGraphicOverrides Overload
Autodesk.Revit.DB Namespace